// Напишите программу, которая на вход принимает число и выдает,является ли число четным

Console.WriteLine("Введите число");
int number = Convert.ToInt32(Console.ReadLine());

 if (number % 2==1)
            {
                Console.WriteLine("число нечетное");
           
            }
            else
            {
                Console.WriteLine("Число четное");
            }
 
            Console.ReadKey();

 